ua1arn/hftrx/lib/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
	case HOST_DELAY:
		if (--phost->gPushTicks == 0)
			phost->gState = phost->gPushState;
		break;

	case HOST_DEV_WAIT_FOR_ATTACHMENT:
		//USBH_UsrLog(PSTR("USBH_Process: HOST_DEV_WAIT_FOR_ATTACHMENT"));

	      if (phost->device.PortEnabled == 1U)
	      {
	        USBH_UsrLog("USB Device Reset Completed");
	        phost->device.RstCnt = 0U;
	        phost->gState = HOST_DEV_ATTACHED;
	      }
	      else
	      {
	        if (phost->Timeout > USBH_DEV_RESET_TIMEOUT)
	        {
	          phost->device.RstCnt++;
	          if (phost->device.RstCnt > 3U)
	          {
	            /* Buggy Device can't complete reset */
	            USBH_UsrLog("USB Reset Failed, Please unplug the Device.");
	            phost->gState = HOST_ABORT_STATE;
	          }
	          else
	          {
	            phost->gState = HOST_IDLE;
	          }
	        }
	        else
	        {
	          phost->Timeout += 10U;
	          USBH_Delay(10U);
	        }
	      }
	#if (USBH_USE_OS == 1U)
	      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
	#if (osCMSIS < 0x20000U)
	      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
	#else
	      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
	#endif
	#endif
		break;

	case HOST_DEV_BEFORE_ATTACHED:
		// в этом состоянии игнорируем disconnect - возникает при старте устройства с установленным USB устройством
		//USBH_UsrLog(PSTR("USBH_Process: HOST_DEV_BEFORE_ATTACHED"));
		/* Wait for 100 ms after Reset */
		USBH_ProcessDelay(phost, HOST_DEV_ATTACHED_WAITSPEED, 100);
		break;

	case HOST_DEV_ATTACHED_WAITSPEED:
		// Ожидаем пока не завершится процесс выясненеия скорости, на которой может работать device.
		if (USBH_LL_GetSpeedReady(phost))
			phost->gState = HOST_DEV_ATTACHED;
		else
			;		//dbg_putchar('^');
		break;

	case HOST_DEV_ATTACHED:
		//USBH_UsrLog(PSTR("USBH_Process: HOST_DEV_ATTACHED"));
		/* после таймаута */
		phost->device.speed = (uint8_t) USBH_LL_GetSpeed(phost);

		phost->gState = HOST_ENUMERATION;

		phost->Control.pipe_out = USBH_AllocPipe(phost, 0x00U);
		phost->Control.pipe_in = USBH_AllocPipe(phost, 0x80U);

		/* Open Control pipes */
		(void) USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U,
				phost->device.address, phost->device.speed,
				USBH_EP_CONTROL, (uint16_t) phost->Control.pipe_size);

		/* Open Control pipes */
		(void) USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U,
				phost->device.address, phost->device.speed,
				USBH_EP_CONTROL, (uint16_t) phost->Control.pipe_size);

#if (USBH_USE_OS == 1U)
	      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
	#if (osCMSIS < 0x20000U)
	      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
	#else
	      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
	#endif
	#endif
		break;

	case HOST_ENUMERATION:
		//USBH_UsrLog(PSTR("USBH_Process: HOST_ENUMERATION\n"));
		/* Check for enumeration status */
		if (USBH_HandleEnum(phost) == USBH_OK) {
			/* The function shall return USBH_OK when full enumeration is complete */
			USBH_UsrLog(PSTR("Enumeration done."));
			phost->device.current_interface = 0;
			if (phost->device.DevDesc.bNumConfigurations == 1) {
				USBH_UsrLog(PSTR("This device has only 1 configuration."));
				phost->gState = HOST_SET_CONFIGURATION;
			} else {
				phost->gState = HOST_INPUT;
			}

		}
#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HOST_INPUT:
		//USBH_UsrLog(PSTR("USBH_Process: HOST_INPUT\n"));
	{
		/* user callback for end of device basic enumeration */
		if (phost->pUser != NULL) {
			phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
			phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1U)
		  phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
	#if (osCMSIS < 0x20000U)
		  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
	#else
		  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
	#endif
	#endif
		}
	}
		break;

	case HOST_SET_CONFIGURATION:
		//USBH_UsrLog(PSTR("USBH_Process: HOST_SET_CONFIGURATION"));
		/* set configuration */
		if (USBH_SetCfg(phost,
				(uint16_t) phost->device.CfgDesc.bConfigurationValue)
				== USBH_OK) {
			phost->gState = HOST_SET_WAKEUP_FEATURE;
			USBH_UsrLog("Default configuration set.");
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HOST_SET_WAKEUP_FEATURE:

		if (((phost->device.CfgDesc.bmAttributes) & (1U << 5)) != 0U) {
			status = USBH_SetFeature(phost, FEATURE_SELECTOR_REMOTEWAKEUP);

			if (status == USBH_OK) {
				USBH_UsrLog("Device remote wakeup enabled");
				phost->gState = HOST_CHECK_CLASS;
			} else if (status == USBH_NOT_SUPPORTED) {
				USBH_UsrLog("Remote wakeup not supported by the device");
				phost->gState = HOST_CHECK_CLASS;
			} else {
				/* .. */
			}
		} else {
			phost->gState = HOST_CHECK_CLASS;
		}

#if (USBH_USE_OS == 1U)
    phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
    (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
    (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HOST_CHECK_CLASS:
		// Если USBH_GetActiveClass(phost) == 0x01 - работаем с составным устройством.
		//USBH_UsrLog(PSTR("USBH_Process: HOST_CHECK_CLASS (0x%02X)"), (unsigned) USBH_GetActiveClass(phost));
		if (phost->ClassNumber == 0) {
			USBH_UsrLog(PSTR("No Class has been registered.\n"));
			phost->gState = HOST_ABORT_STATE;
		} else {
			uint_fast8_t idx = 0;
			phost->pActiveClass = NULL;

			for (idx = 0; idx < phost->ClassNumber; idx++) {
				if (phost->pClass[idx] != NULL
						&& phost->pClass[idx]->ClassCode
								== USBH_GetActiveClass(phost)) {
					phost->pActiveClass = phost->pClass[idx];
					break;	// или должен был последний из встретив
				}
			}

			if (phost->pActiveClass != NULL) {
				if (phost->pActiveClass->Init(phost) == USBH_OK) {
					phost->gState = HOST_CLASS_REQUEST;
					USBH_UsrLog(PSTR("%s class started."),
							phost->pActiveClass->Name);

