ua1arn/hftrx/lib/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
	case ENUM_GET_FULL_CFG_DESC:
		/* get FULL config descriptor (config, interface, endpoints) */
		ReqStatus = USBH_Get_CfgDesc(phost, phost->device.CfgDesc.wTotalLength);
		if (ReqStatus == USBH_OK) {
			phost->EnumState = ENUM_GET_MFC_STRING_DESC;
		} else if (ReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog(
					"Control error: Get Device configuration descriptor request failed");
			phost->device.EnumCnt++;
			if (phost->device.EnumCnt > 3U) {
				/* Buggy Device can't complete get device desc request */
				USBH_UsrLog(
						"Control error, Device not Responding Please unplug the Device.");
				phost->gState = HOST_ABORT_STATE;
			} else {
				/* Free control pipes */
				(void) USBH_FreePipe(phost, phost->Control.pipe_out);
				(void) USBH_FreePipe(phost, phost->Control.pipe_in);

				/* Reset the USB Device */
				phost->EnumState = ENUM_IDLE;
				phost->gState = HOST_IDLE;
			}
		} else {
			/* .. */
		}
		break;

	case ENUM_GET_MFC_STRING_DESC:
		if (phost->device.DevDesc.iManufacturer != 0U) {
			/* Check that Manufacturer String is available */
			ReqStatus = USBH_Get_StringDesc(phost,
					phost->device.DevDesc.iManufacturer, phost->device.Data,
					0xFFU);
			if (ReqStatus == USBH_OK) {
				/* User callback for Manufacturing string */
				USBH_UsrLog("Manufacturer : %s",
						(char* )(void* )phost->device.Data);
				phost->EnumState = ENUM_GET_PRODUCT_STRING_DESC;

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			} else if (ReqStatus == USBH_NOT_SUPPORTED) {
				USBH_UsrLog("Manufacturer : N/A");
				phost->EnumState = ENUM_GET_PRODUCT_STRING_DESC;

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			} else {
				/* .. */
			}
		} else {
			USBH_UsrLog("Manufacturer : N/A");
			phost->EnumState = ENUM_GET_PRODUCT_STRING_DESC;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		}
		break;

	case ENUM_GET_PRODUCT_STRING_DESC:
		if (phost->device.DevDesc.iProduct != 0U) {
			/* Check that Product string is available */
			ReqStatus = USBH_Get_StringDesc(phost,
					phost->device.DevDesc.iProduct, phost->device.Data, 0xFFU);
			if (ReqStatus == USBH_OK) {
				/* User callback for Product string */
				USBH_UsrLog("Product : %s", (char* )(void* )phost->device.Data);
				phost->EnumState = ENUM_GET_SERIALNUM_STRING_DESC;
			} else if (ReqStatus == USBH_NOT_SUPPORTED) {
				USBH_UsrLog("Product : N/A");
				phost->EnumState = ENUM_GET_SERIALNUM_STRING_DESC;

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			} else {
				/* .. */
			}
		} else {
			USBH_UsrLog("Product : N/A");
			phost->EnumState = ENUM_GET_SERIALNUM_STRING_DESC;

#if (USBH_USE_OS == 1U)
        phost->os_msg = (uint32_t)USBH_STATE_CHANGED_EVENT;
#if (osCMSIS < 0x20000U)
        (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
        (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		}
		break;

	case ENUM_GET_SERIALNUM_STRING_DESC:
		if (phost->device.DevDesc.iSerialNumber != 0U) {
			/* Check that Serial number string is available */
			ReqStatus = USBH_Get_StringDesc(phost,
					phost->device.DevDesc.iSerialNumber, phost->device.Data,
					0xFFU);
			if (ReqStatus == USBH_OK) {
				/* User callback for Serial number string */
				USBH_UsrLog("Serial Number : %s",
						(char* )(void* )phost->device.Data);
				Status = USBH_OK;
			} else if (ReqStatus == USBH_NOT_SUPPORTED) {
				USBH_UsrLog("Serial Number : N/A");
				Status = USBH_OK;
			} else {
				/* .. */
			}
		} else {
			USBH_UsrLog("Serial Number : N/A");
			Status = USBH_OK;
		}
		break;

	default:
		break;
	}
	return Status;
}


/**
  * @brief  USBH_LL_SetTimer
  *         Set the initial Host Timer tick
  * @param  phost: Host Handle
  * @retval None
  */
void  USBH_LL_SetTimer(USBH_HandleTypeDef *phost, uint32_t time)
{
  phost->Timer = time;
}


/**
  * @brief  USBH_LL_IncTimer
  *         Increment Host Timer tick
  * @param  phost: Host Handle
  * @retval None
  */
void  USBH_LL_IncTimer(USBH_HandleTypeDef *phost)
{
  phost->Timer++;
  USBH_HandleSof(phost);
}


/**
  * @brief  USBH_HandleSof
  *         Call SOF process
  * @param  phost: Host Handle
  * @retval None
  */
static void  USBH_HandleSof(USBH_HandleTypeDef *phost)
{
  if ((phost->gState == HOST_CLASS) && (phost->pActiveClass != NULL))
  {
    phost->pActiveClass->SOFProcess(phost);
  }
}


/**
  * @brief  USBH_PortEnabled
  *         Port Enabled
  * @param  phost: Host Handle
  * @retval None
  */
void USBH_LL_PortEnabled(USBH_HandleTypeDef *phost)
{
  phost->device.PortEnabled = 1U;

#if (USBH_USE_OS == 1U)
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

  return;
}


/**
  * @brief  USBH_LL_PortDisabled
  *         Port Disabled
  * @param  phost: Host Handle
  * @retval None
  */
void USBH_LL_PortDisabled(USBH_HandleTypeDef *phost)
{
  phost->device.PortEnabled = 0U;

  return;
}


/**
  * @brief  HCD_IsPortEnabled
  *         Is Port Enabled
  * @param  phost: Host Handle
  * @retval None
  */
uint8_t USBH_IsPortEnabled(USBH_HandleTypeDef *phost)
{
  return (phost->device.PortEnabled);
}


/**
  * @brief  USBH_LL_Connect
  *         Handle USB Host connexion event
  * @param  phost: Host Handle
  * @retval USBH_Status
  */
USBH_StatusTypeDef  USBH_LL_Connect(USBH_HandleTypeDef *phost)
 {
	phost->device.is_connected = 1U;
	phost->device.is_disconnected = 0U;
	phost->device.is_ReEnumerated = 0U;

#if (USBH_USE_OS == 1U)
	  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
	#if (osCMSIS < 0x20000U)
	  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
	#else
	  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
	#endif
	#endif

	return USBH_OK;

