ua1arn/hftrx/lib/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
	switch (phost->gState) {
	case HOST_IDLE:
		//PRINTF(PSTR("USBH_LL_Connect at HOST_IDLE\n"));
		phost->device.is_connected = 1U;
		phost->device.is_disconnected = 0U;
		phost->device.is_ReEnumerated = 0U;

#if (USBH_USE_OS == 1U)
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

//		if (phost->pUser != NULL)
//		{
//			phost->pUser(phost, HOST_USER_CONNECTION);
//		}
		break;

	case HOST_DEV_WAIT_FOR_ATTACHMENT:
		//PRINTF(PSTR("USBH_LL_Connect at HOST_DEV_WAIT_FOR_ATTACHMENT\n"));
		phost->gState = HOST_DEV_BEFORE_ATTACHED;
		break;

	default:
		break;
	}

	return USBH_OK;
}


/**
  * @brief  USBH_LL_Disconnect
  *         Handle USB Host disconnection event
  * @param  phost: Host Handle
  * @retval USBH_Status
  */
USBH_StatusTypeDef  USBH_LL_Disconnect(USBH_HandleTypeDef *phost)
 {
	/* update device connection states */
	phost->device.is_disconnected = 1U;
	phost->device.is_connected = 0U;
	phost->device.PortEnabled = 0U;

	/* Stop Host */
	(void) USBH_LL_Stop(phost);

	/* FRee Control Pipes */
	(void) USBH_FreePipe(phost, phost->Control.pipe_in);
	(void) USBH_FreePipe(phost, phost->Control.pipe_out);
#if (USBH_USE_OS == 1U)
	  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
	#if (osCMSIS < 0x20000U)
	  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
	#else
	  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
	#endif
	#endif

	return USBH_OK;
	//USBH_UsrLog("USBH_LL_Disconnect");

	switch (phost->gState) {
	case HOST_DEV_BEFORE_ATTACHED:
		//PRINTF(PSTR("USBH_LL_Disconnect at HOST_DEV_BEFORE_ATTACHED\n"));
		return USBH_OK;

	default:
		//PRINTF(PSTR("USBH_LL_Disconnect at phost->gState=%d\n"), (int) phost->gState);
		break;
	}

	phost->device.is_disconnected = 1U;
	phost->device.is_connected = 0U;
	phost->device.PortEnabled = 0U;
	/*Stop Host */
	USBH_LL_Stop(phost);

	/* Free Control Pipes */
	USBH_FreePipe(phost, phost->Control.pipe_in);
	USBH_FreePipe(phost, phost->Control.pipe_out);

	if (phost->pUser != NULL) {
		phost->pUser(phost, HOST_USER_DISCONNECTION);
	}

	//PRINTF(PSTR("USB Device disconnected\n"));

	/* Start the low level driver  */
	USBH_LL_Start(phost);

	phost->gState = HOST_DEV_DISCONNECTED;

#if (USBH_USE_OS == 1)
	osMessagePut ( phost->os_event, USBH_PORT_EVENT, 0);
#endif

	return USBH_OK;
	/* update device connection states */
	phost->device.is_disconnected = 1U;
	phost->device.is_connected = 0U;
	phost->device.PortEnabled = 0U;

	/* Stop Host */
	(void) USBH_LL_Stop(phost);

	/* FRee Control Pipes */
	(void) USBH_FreePipe(phost, phost->Control.pipe_in);
	(void) USBH_FreePipe(phost, phost->Control.pipe_out);
#if (USBH_USE_OS == 1U)
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;
#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

	return USBH_OK;
}


#if (USBH_USE_OS == 1U)
/**
  * @brief  USB Host Thread task
  * @param  pvParameters not used
  * @retval None
  */

#if (osCMSIS < 0x20000U)
static void USBH_Process_OS(void const *argument)
{
  osEvent event;

  for (;;)
  {
    event = osMessageGet(((USBH_HandleTypeDef *)argument)->os_event, osWaitForever);
    if (event.status == osEventMessage)
    {
      USBH_Process((USBH_HandleTypeDef *)argument);
    }
  }
}
#else
static void USBH_Process_OS(void *argument)
{
  osStatus_t status;

  for (;;)
  {
    status = osMessageQueueGet(((USBH_HandleTypeDef *)argument)->os_event,
                               &((USBH_HandleTypeDef *)argument)->os_msg, NULL, osWaitForever);
    if (status == osOK)
    {
      USBH_Process((USBH_HandleTypeDef *)argument);
    }
  }
}
#endif /* (osCMSIS < 0x20000U) */


/**
  * @brief  USBH_LL_NotifyURBChange
  *         Notify URB state Change
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef  USBH_LL_NotifyURBChange(USBH_HandleTypeDef *phost)
{
  phost->os_msg = (uint32_t)USBH_PORT_EVENT;

#if (osCMSIS < 0x20000U)
  (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
  (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif

  return USBH_OK;
}
#endif
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
